[
  {
    "tool_name": "sample_tool",
    "query": "What's the weather like in London right now?"
  },
  {
    "tool_name": "sample_tool",
    "query": "Can you tell me the current temperature in Paris?"
  },
  {
    "tool_name": "sample_tool",
    "query": "I need to check the weather conditions in New York"
  },
  {
    "tool_name": "sample_tool",
    "query": "Show me today's weather for Tokyo in Fahrenheit"
  },
  {
    "tool_name": "sample_tool",
    "query": "What's the current temperature and humidity in Sydney?"
  },
  {
    "tool_name": "sample_tool",
    "query": "Give me the weather details for Berlin"
  },
  {
    "tool_name": "sample_tool",
    "query": "I want to know the current weather in Madrid"
  },
  {
    "tool_name": "sample_tool",
    "query": "Can you pull up the weather information for Chicago?"
  },
  {
    "tool_name": "sample_tool",
    "query": "What are the current conditions in Rome?"
  },
  {
    "tool_name": "sample_tool",
    "query": "Get me the weather for San Francisco"
  },
  {
    "tool_name": "sample_tool",
    "query": "I'd like to see the current weather in Moscow"
  },
  {
    "tool_name": "sample_tool",
    "query": "Check the temperature and wind speed in Toronto"
  },
  {
    "tool_name": "sample_tool",
    "query": "What's happening with the weather in Mumbai today?"
  },
  {
    "tool_name": "sample_tool",
    "query": "Show me the current conditions in Mexico City"
  },
  {
    "tool_name": "sample_tool",
    "query": "I need a weather update for Amsterdam"
  },
  {
    "tool_name": "sample_tool",
    "query": "Can you retrieve the weather for Dubai?"
  },
  {
    "tool_name": "sample_tool",
    "query": "Give me the current weather in Barcelona with a 5-day forecast"
  },
  {
    "tool_name": "sample_tool",
    "query": "What's the temperature in Singapore right now?"
  },
  {
    "tool_name": "sample_tool",
    "query": "Fetch the weather information for Vancouver in Fahrenheit"
  },
  {
    "tool_name": "sample_tool",
    "query": "I need to check the weather forecast for San Francisco for the next few days"
  },
  {
    "tool_name": "sample_tool",
    "query": "Can you tell me the current conditions in Tokyo, preferably in Fahrenheit?"
  },
  {
    "tool_name": "sample_tool",
    "query": "I'm planning a trip to Sydney and want to know what the weather will be like"
  },
  {
    "tool_name": "sample_tool",
    "query": "What's the humidity and wind speed in New York City today?"
  },
  {
    "tool_name": "sample_tool",
    "query": "What's the weather like in Paris right now?"
  },
  {
    "tool_name": "sample_tool",
    "query": "Give me the current weather details for London"
  },
  {
    "tool_name": "sample_tool",
    "query": "Weather report for Tokyo, please"
  },
  {
    "tool_name": "sample_tool",
    "query": "What's happening with the weather in Berlin today?"
  },
  {
    "tool_name": "sample_tool",
    "query": "Show me current conditions in San Francisco in Fahrenheit"
  },
  {
    "tool_name": "sample_tool",
    "query": "I want to know the temperature and humidity in Rio de Janeiro"
  },
  {
    "tool_name": "sample_tool",
    "query": "Can you pull up the latest weather info for Toronto?"
  },
  {
    "tool_name": "sample_tool",
    "query": "Get me the current weather for Mexico City"
  },
  {
    "tool_name": "sample_tool",
    "query": "What are the current conditions in Dubai?"
  },
  {
    "tool_name": "sample_tool",
    "query": "I'm looking for weather information in Beijing, including forecast"
  },
  {
    "tool_name": "sample_tool",
    "query": "Retrieve weather data for Amsterdam with a 5-day forecast"
  },
  {
    "tool_name": "sample_tool",
    "query": "I need a full weather report for Moscow, including wind speed"
  },
  {
    "tool_name": "sample_tool",
    "query": "Show me the current temperature and conditions in Cairo"
  },
  {
    "tool_name": "sample_tool",
    "query": "Weather details for Vancouver, please. I want Fahrenheit units"
  },
  {
    "tool_name": "sample_tool",
    "query": "Get current weather information for Buenos Aires"
  },
  {
    "tool_name": "sample_tool",
    "query": "What's the weather looking like in Auckland right now?"
  },
  {
    "tool_name": "sample_tool",
    "query": "What's the temperature going to be in Chicago tomorrow?"
  },
  {
    "tool_name": "sample_tool",
    "query": "I need to know if I should pack a jacket for my trip to Seattle this weekend"
  },
  {
    "tool_name": "sample_tool",
    "query": "Can you tell me the current conditions in Miami right now?"
  },
  {
    "tool_name": "sample_tool",
    "query": "I'm planning a hike and want to check wind speeds and humidity for Denver"
  },
  {
    "tool_name": "sample_tool",
    "query": "Will it be warm enough for outdoor dining in San Francisco this evening?"
  }
]