[
  {
    "tool_name": "questionnaire_tool",
    "query": "I need to collect some feedback from my team about our recent project. Can we go through a quick survey?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "Let's do a customer satisfaction assessment. Can you help me create and run a short questionnaire with 5 key questions?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I want to gather employee opinions about our new remote work policy. Could you guide me through an interactive survey to collect their thoughts?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I have a list of survey questions I need to turn into a proper questionnaire format. Can you help me structure these?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "Take these raw question texts and generate standardized question objects with unique identifiers for my research project"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I want to prepare these interview questions for my data collection tool. Could you format them with consistent IDs and structure?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I've already answered some of these survey questions in previous sessions. Can we skip the ones I've completed before?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "Remove the questions I've already responded to from the current questionnaire set"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I want to avoid repeating questions I've already answered. Can you filter out the redundant ones based on my previous responses?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I want to create a survey where the next questions change based on my previous answers. Can you help me design a dynamic questionnaire?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I need to build an adaptive interview process where follow-up questions are generated based on the participant's initial responses. How can I set that up?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "Create a questionnaire that adjusts its questions in real-time depending on what the user has already answered. The questions should be context-aware and personalized."
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "Let's do a step-by-step assessment of customer satisfaction. I want to ask a series of questions and record the responses."
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I'm conducting research and want to guide participants through a structured set of interview questions. Can we set up an interactive questionnaire?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I need to collect feedback from my team about our recent project. What's the best way to create a structured survey?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "Can you help me gather some systematic information from customers about their experience with our new product?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I want to conduct a comprehensive assessment of employee satisfaction across different departments."
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "How can I create an interactive form to collect detailed information from participants in a research study?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I'm looking to design a step-by-step interview process that guides respondents through a series of carefully structured questions."
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I need to gather feedback from my team about our recent project. Can we start an interview process to collect their insights?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "Help me conduct a quick survey about customer satisfaction. I want to ask 3-4 questions about their recent experience with our service."
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "Let's create an employee onboarding assessment. I want to design a series of questions to understand their initial impressions and background."
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I have a list of survey questions and need them turned into structured question objects with IDs"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "Can you help me prepare these raw question strings for a questionnaire by giving them unique identifiers?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I've got some interview questions written down. Could you format them into a proper question collection with sequential IDs?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I want to remove the questions I've previously answered from my current questionnaire. What questions are still pending?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I've got some existing responses from a past session. Help me identify which questions in this new set I haven't addressed yet."
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I'm developing a personalized assessment that should dynamically generate follow-up questions depending on what the participant initially responds. How can I set that up?"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "Can we create a multi-step interview flow where the questions adapt in real-time? I need the options and next questions to be generated based on earlier responses."
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I want to create a step-by-step assessment to understand customer satisfaction with our new product line"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "Help me develop a comprehensive intake form for new volunteers that captures all their skills and preferences"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "I'm researching user experiences and need to build an interactive set of questions that dynamically adjust based on previous answers"
  },
  {
    "tool_name": "questionnaire_tool",
    "query": "Can we create a guided interview process that walks someone through a series of progressively detailed questions about their background and interests?"
  }
]