[
  {
    "tool_name": "weather_tool",
    "query": "What's the weather going to be like in San Francisco tomorrow? I need to plan my outdoor work."
  },
  {
    "tool_name": "weather_tool",
    "query": "Can you give me the hourly forecast for coordinates 37.7749, -122.4194 for the next few days?"
  },
  {
    "tool_name": "weather_tool",
    "query": "I'm working on a construction site in Phoenix. What are the temperature and humidity predictions for next week?"
  },
  {
    "tool_name": "weather_tool",
    "query": "Show me the weather forecast for my location: latitude 40.7128, longitude -74.0060"
  },
  {
    "tool_name": "weather_tool",
    "query": "I need to check the heat conditions for an outdoor event in Miami on August 15th. Can you pull the detailed weather data?"
  },
  {
    "tool_name": "weather_tool",
    "query": "What weather parameters can I expect in Las Vegas this weekend? Particularly interested in temperature and wind."
  },
  {
    "tool_name": "weather_tool",
    "query": "I'm planning some field work. Can you retrieve the weather forecast for these GPS coordinates: 34.0522° N, 118.2437° W?"
  },
  {
    "tool_name": "weather_tool",
    "query": "Looking for a detailed weather outlook for my job site in Houston. What conditions should I prepare for?"
  },
  {
    "tool_name": "weather_tool",
    "query": "Give me the full weather breakdown for Denver tomorrow - I need to know about temperature, precipitation, and wind speed."
  },
  {
    "tool_name": "weather_tool",
    "query": "I need to check heat stress risk for my construction crew working in Phoenix today"
  },
  {
    "tool_name": "weather_tool",
    "query": "Calculate WBGT for outdoor workers at 33.4484° N, 112.0740° W"
  },
  {
    "tool_name": "weather_tool",
    "query": "What's the heat stress level for landscaping work in Las Vegas this afternoon?"
  },
  {
    "tool_name": "weather_tool",
    "query": "Can you help me assess worker safety conditions for a road crew in Death Valley?"
  },
  {
    "tool_name": "weather_tool",
    "query": "I want to know the heat risk for my team doing field maintenance at latitude 37.7749, longitude -122.4194"
  },
  {
    "tool_name": "weather_tool",
    "query": "Checking heat stress index for agricultural workers in Central Valley, California"
  },
  {
    "tool_name": "weather_tool",
    "query": "Provide heat stress assessment for outdoor workers in Phoenix, Arizona for tomorrow"
  },
  {
    "tool_name": "weather_tool",
    "query": "I need to evaluate heat exposure risk for utility workers at 32.7767° N, 96.7970° W"
  },
  {
    "tool_name": "weather_tool",
    "query": "Calculate heat stress conditions for my team working outside in Texas this week"
  },
  {
    "tool_name": "weather_tool",
    "query": "What's the heat risk for outdoor workers in Phoenix this week?"
  },
  {
    "tool_name": "weather_tool",
    "query": "I need to check temperature and humidity for a construction site in Miami tomorrow"
  },
  {
    "tool_name": "weather_tool",
    "query": "Can you help me understand the forecast for potential heat stress conditions in Las Vegas next week?"
  },
  {
    "tool_name": "weather_tool",
    "query": "I'm planning field work in Texas and want to know the hourly temperature and humidity predictions"
  },
  {
    "tool_name": "weather_tool",
    "query": "What are the expected heat index levels for agricultural workers in Central Valley, California?"
  },
  {
    "tool_name": "weather_tool",
    "query": "What's the weather looking like in San Francisco this afternoon? I need to know the temperature and humidity."
  },
  {
    "tool_name": "weather_tool",
    "query": "Can you pull the forecast for coordinates 37.7749, -122.4194 for tomorrow?"
  },
  {
    "tool_name": "weather_tool",
    "query": "I'm planning outdoor work in Phoenix. Give me an hourly breakdown of temperature and heat stress conditions for next Wednesday."
  },
  {
    "tool_name": "weather_tool",
    "query": "Looking at doing some landscaping work. Can you check the weather conditions for my location (latitude 33.4484, longitude -112.0740)?"
  },
  {
    "tool_name": "weather_tool",
    "query": "I need to know the expected weather parameters for my construction site in Las Vegas this weekend."
  },
  {
    "tool_name": "weather_tool",
    "query": "Check the upcoming weather for 40.7128, -74.0060 - want to see if it's good for outdoor training."
  },
  {
    "tool_name": "weather_tool",
    "query": "Can you get me the detailed forecast for Seattle? Specifically interested in precipitation and wind speeds."
  },
  {
    "tool_name": "weather_tool",
    "query": "I'm a field technician working outside tomorrow. What are the temperature and humidity looking like in Denver?"
  },
  {
    "tool_name": "weather_tool",
    "query": "Forecast for Austin, Texas coordinates? Need to know about potential heat stress conditions for my work crew."
  },
  {
    "tool_name": "weather_tool",
    "query": "What's the WBGT index for outdoor workers in Las Vegas right now?"
  },
  {
    "tool_name": "weather_tool",
    "query": "Calculate heat safety conditions for my landscaping team at 33.4484° N, 112.0740° W"
  },
  {
    "tool_name": "weather_tool",
    "query": "I'm planning outdoor work tomorrow and want to assess heat stress potential"
  },
  {
    "tool_name": "weather_tool",
    "query": "Show me heat risk levels for field technicians working in central Texas this afternoon"
  },
  {
    "tool_name": "weather_tool",
    "query": "Evaluate occupational heat exposure for my road construction team at these coordinates: 37.7749, -122.4194"
  },
  {
    "tool_name": "weather_tool",
    "query": "Can you help me determine if it's safe for my workers to be outside given the current temperature and humidity?"
  },
  {
    "tool_name": "weather_tool",
    "query": "Check heat stress conditions for agricultural workers in the Central Valley of California"
  },
  {
    "tool_name": "weather_tool",
    "query": "I need a detailed heat risk assessment for outdoor labor in the Sonoran Desert"
  },
  {
    "tool_name": "weather_tool",
    "query": "I need to check the temperature and humidity for outdoor work tomorrow in Phoenix, Arizona"
  },
  {
    "tool_name": "weather_tool",
    "query": "What's the heat stress risk for construction workers at 33.4484° N, 112.0740° W this afternoon?"
  },
  {
    "tool_name": "weather_tool",
    "query": "Can you help me determine if it's safe for my crew to work outside today? We're doing landscaping in central Texas"
  },
  {
    "tool_name": "weather_tool",
    "query": "I want to see the hourly forecast for the next 24 hours, focusing on temperature and wind conditions"
  },
  {
    "tool_name": "weather_tool",
    "query": "Looking for detailed weather data to assess potential heat-related risks for workers doing field maintenance"
  }
]