[
  {
    "tool_name": "calendar_tool",
    "query": "Can you show me all my upcoming events for the next week?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "I want to see everything on my calendars from today through next Friday"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Can you show me the events from my university's academic calendar for next month?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "I want to pull in the shared holiday schedule from this public iCal link I have: https://example.com/holidays.ical"
  },
  {
    "tool_name": "calendar_tool",
    "query": "What calendars do I have access to on my CalDAV server?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Can you show me all the calendars connected to my account? I want to see what's available."
  },
  {
    "tool_name": "calendar_tool",
    "query": "I'm trying to view my calendars from https://mycaldav.example.com - can you help me list them out?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "What events do I have scheduled this week on my work calendar?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Can you show me all my upcoming events from my personal Google calendar between July 1st and July 15th?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "I need to schedule a team meeting next Tuesday from 2 PM to 3:30 PM in the conference room"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Add a dentist appointment on March 15th at 10 AM for 45 minutes"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Can you help me block out time for my project deadline review? It's on April 5th from 11:00 AM to 12:15 PM with my manager"
  },
  {
    "tool_name": "calendar_tool",
    "query": "I accidentally created a duplicate meeting. Can you remove the extra event from my work calendar?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Please delete the dentist appointment I scheduled for next Thursday - I need to reschedule."
  },
  {
    "tool_name": "calendar_tool",
    "query": "Oops, I no longer need the team lunch event I just added to my shared team calendar. Can you take that off?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Can you show me all my events for next week across my different calendars?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "I want to add a team meeting to our shared work calendar for next Thursday at 2 PM"
  },
  {
    "tool_name": "calendar_tool",
    "query": "What calendars are available on my CalDAV server right now?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "I need to import events from this public iCal URL I just found"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Could you help me remove a duplicate event I accidentally created?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Show me all my upcoming events for the next week"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Can you pull events from my work and personal calendars between August 1st and 15th?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Can you show me the events on my company's shared calendar for next week?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "I want to pull events from our team's Google Calendar link - can you grab everything between July 1st and July 15th?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Can you show me all the calendars I have connected to my account?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "I want to view the different calendars available on my CalDAV server. Which ones do I have access to?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Help me see what calendars are synced right now. I'm trying to get an overview of my calendar sources."
  },
  {
    "tool_name": "calendar_tool",
    "query": "Can you show me my upcoming events this week from my work calendar?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "I need to see all events between July 15th and July 22nd on my personal Google calendar"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Can you add a dentist appointment for me on June 15th at 10 am that will last an hour?"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Planning my sister's baby shower - want to block off Saturday the 22nd from noon to 4 PM with details about the party location and some notes"
  },
  {
    "tool_name": "calendar_tool",
    "query": "I accidentally created a duplicate meeting and need to remove the extra one from my work calendar"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Can you help me get rid of that dentist appointment I no longer need? It's in my personal Google calendar"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Remove the team lunch event I just scheduled for next Thursday - something came up and I can't make it anymore"
  },
  {
    "tool_name": "calendar_tool",
    "query": "I need to view the events from my work calendar between January 15th and 22nd"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Help me add a new team meeting to our shared project calendar for next Thursday at 2 PM"
  },
  {
    "tool_name": "calendar_tool",
    "query": "I want to check the events from this public conference calendar URL I was given"
  },
  {
    "tool_name": "calendar_tool",
    "query": "Could you list all the available calendars I have connected to my account?"
  }
]