[
  {
    "tool_name": "email_tool",
    "query": "Can you help me find all unread emails from my project manager?"
  },
  {
    "tool_name": "email_tool",
    "query": "I need to draft an email to the team about our quarterly results, but I want to review it before sending"
  },
  {
    "tool_name": "email_tool",
    "query": "Can you pull up the email thread with the client from last week about the contract details?"
  },
  {
    "tool_name": "email_tool",
    "query": "I accidentally marked an important email as read. Is there a way to undo that?"
  },
  {
    "tool_name": "email_tool",
    "query": "I want to send a follow-up message to the conference speakers with their presentation details"
  },
  {
    "tool_name": "email_tool",
    "query": "Can you show me my latest unread emails from work?"
  },
  {
    "tool_name": "email_tool",
    "query": "I want to check my inbox and see the 10 most recent messages, including the full email content"
  },
  {
    "tool_name": "email_tool",
    "query": "Can you pull up the full email thread from last week about the marketing budget? I want to review the details."
  },
  {
    "tool_name": "email_tool",
    "query": "Show me the complete contents of the email my manager sent yesterday with the project proposal - I need to check something specific."
  },
  {
    "tool_name": "email_tool",
    "query": "I've already read this email from my boss. Can you clear the unread flag?"
  },
  {
    "tool_name": "email_tool",
    "query": "I've gone through the project update email. Please mark it as processed so it stops showing as new."
  },
  {
    "tool_name": "email_tool",
    "query": "I accidentally read this email but want to come back to it later. Can you help me reset its status?"
  },
  {
    "tool_name": "email_tool",
    "query": "I just skimmed this message from my boss and want to make sure I review it thoroughly later. How can I flag it to review again?"
  },
  {
    "tool_name": "email_tool",
    "query": "I want to remove this spam email from my inbox. Can you help me get rid of it?"
  },
  {
    "tool_name": "email_tool",
    "query": "Please delete the email from my boss about the quarterly report - I accidentally saved it and don't need it anymore."
  },
  {
    "tool_name": "email_tool",
    "query": "I want to move this important client email from my inbox to the Client Projects folder"
  },
  {
    "tool_name": "email_tool",
    "query": "Can you help me transfer the email about the quarterly report to my Archive folder?"
  },
  {
    "tool_name": "email_tool",
    "query": "Can you help me draft an email to my project manager about the quarterly report?"
  },
  {
    "tool_name": "email_tool",
    "query": "I need to send a quick message to the team about our meeting next week"
  },
  {
    "tool_name": "email_tool",
    "query": "Can you help me draft a response to the email from Sarah about the project timeline?"
  },
  {
    "tool_name": "email_tool",
    "query": "I want to send a quick reply to that customer support ticket I received earlier today"
  },
  {
    "tool_name": "email_tool",
    "query": "I want to save an email I'm working on for later. Can you help me draft something to my team about the quarterly report?"
  },
  {
    "tool_name": "email_tool",
    "query": "Need to write an email to Sarah about the project proposal, but I'm not ready to send it yet. Can you help me start a draft?"
  },
  {
    "tool_name": "email_tool",
    "query": "Can you help me find emails from my boss about the quarterly report from last month?"
  },
  {
    "tool_name": "email_tool",
    "query": "I need to track down some unread emails from Sarah that came in between 15-Jan-2024 and 22-Jan-2024"
  },
  {
    "tool_name": "email_tool",
    "query": "What folders do I have in my email account right now?"
  },
  {
    "tool_name": "email_tool",
    "query": "Can you show me all the different folders I've set up in my mailbox?"
  },
  {
    "tool_name": "email_tool",
    "query": "I'll check this email later when I have more time to draft a proper response."
  },
  {
    "tool_name": "email_tool",
    "query": "Need to come back to this message - want to make sure I give it the attention it deserves when I'm not rushed."
  },
  {
    "tool_name": "email_tool",
    "query": "I want to see all the emails I've set aside to respond to later"
  },
  {
    "tool_name": "email_tool",
    "query": "Can you pull up the list of messages I've marked to follow up on when I have more time?"
  },
  {
    "tool_name": "email_tool",
    "query": "I need to find all unread emails from my boss from the past week"
  },
  {
    "tool_name": "email_tool",
    "query": "Can you help me draft an email to the project team about our upcoming meeting?"
  },
  {
    "tool_name": "email_tool",
    "query": "I want to move some important client emails to a separate folder to organize them"
  },
  {
    "tool_name": "email_tool",
    "query": "I'm looking for an email I received last month about the quarterly budget - can you help me track it down?"
  },
  {
    "tool_name": "email_tool",
    "query": "I need to reply to that important message from HR but I'm not ready to send the response right now"
  },
  {
    "tool_name": "email_tool",
    "query": "Can you show me the unread emails in my inbox?"
  },
  {
    "tool_name": "email_tool",
    "query": "I want to check my recent emails from my colleague Sarah. Can you pull the last 10 messages from her?"
  },
  {
    "tool_name": "email_tool",
    "query": "I want to remove the blue dot/unread indicator from the email with ID 8f3a-4c9d-b2e1-7f5c"
  },
  {
    "tool_name": "email_tool",
    "query": "Find the email from my boss about the quarterly report and make sure it shows as new again so I don't forget to review it carefully"
  },
  {
    "tool_name": "email_tool",
    "query": "I want to get rid of that spam email from last week. The one with the weird subject line about crypto."
  },
  {
    "tool_name": "email_tool",
    "query": "Can you remove the email from my boss about the canceled meeting? I don't need it cluttering up my inbox anymore."
  },
  {
    "tool_name": "email_tool",
    "query": "I want to organize my inbox by moving this project update email to my Work folder"
  },
  {
    "tool_name": "email_tool",
    "query": "Can you help me shift this newsletter from my main inbox to the Newsletters folder? It's cluttering things up."
  },
  {
    "tool_name": "email_tool",
    "query": "Need to send a quick message to sarah.johnson@company.com about the project deadline"
  },
  {
    "tool_name": "email_tool",
    "query": "I want to send a quick response to that email from marketing about the quarterly report"
  },
  {
    "tool_name": "email_tool",
    "query": "Hit reply and tell Sarah her proposal looks good, but we need to adjust the timeline"
  },
  {
    "tool_name": "email_tool",
    "query": "I want to save an email I'm working on for later - can you help me keep this as a draft?"
  },
  {
    "tool_name": "email_tool",
    "query": "Draft an email to sarah.marketing@company.com about the quarterly report, but don't send it yet. I'll review and send later."
  },
  {
    "tool_name": "email_tool",
    "query": "Can you help me locate unread emails from marketing between January 1st and February 15th?"
  },
  {
    "tool_name": "email_tool",
    "query": "I'm trying to check what email directories I currently have set up. What folders are available in my mailbox?"
  },
  {
    "tool_name": "email_tool",
    "query": "I'll respond to this email later. Can you set a reminder for me?"
  },
  {
    "tool_name": "email_tool",
    "query": "This message needs a thoughtful reply, but I don't have time right now. Flag it so I can come back to it when I'm less busy."
  },
  {
    "tool_name": "email_tool",
    "query": "I want to review all the emails I've set aside to respond to later this week"
  },
  {
    "tool_name": "email_tool",
    "query": "Show me the list of messages I've flagged to follow up on when I have more time"
  }
]