[
  {
    "tool_name": "kasa_tool",
    "query": "What smart home devices are on my network right now?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can you scan and find all my Kasa devices? I want to make sure everything is connected."
  },
  {
    "tool_name": "kasa_tool",
    "query": "What are the current settings for my kitchen smart plug?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can you show me the details of the living room light switch?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Turn off the kitchen smart plug"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can you switch the living room lamp on?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can you make the living room lights a bit dimmer? Set them to around 40% brightness."
  },
  {
    "tool_name": "kasa_tool",
    "query": "I want the kitchen lights to be brighter - turn them up to 75%."
  },
  {
    "tool_name": "kasa_tool",
    "query": "Change living room lamp to a deep purple color"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can you set the kitchen light to a soft orange hue at 50% brightness?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can you make the living room lights warmer? I want a cozy evening atmosphere."
  },
  {
    "tool_name": "kasa_tool",
    "query": "Change the kitchen light to a cooler, more daylight-like color temperature."
  },
  {
    "tool_name": "kasa_tool",
    "query": "How much electricity did my kitchen smart plug use today?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can you show me the current power consumption for my living room power strip?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "I want to rename my kitchen smart plug to 'Refrigerator Outlet'"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can you help me change the name of my living room lamp to 'Evening Reading Light'?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "What devices are plugged into my power strip right now?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can you show me the list of outlets on my multi-outlet smart plug?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Turn off the bottom outlet on my kitchen power strip"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can you switch the second socket of my home office power strip to on?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "How can I turn off all my smart home devices remotely?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "I want to check the energy consumption of my kitchen smart plug this month"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can you help me find all the smart devices connected to my home network?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "I need to change the color and brightness of my living room smart bulbs"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Is there a way to control the individual outlets on my multi-socket smart power strip?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can you help me find all the smart home devices currently connected to my home network? I want to make sure everything is working and see what's available."
  },
  {
    "tool_name": "kasa_tool",
    "query": "I just moved into a new place and want to scan my local network for any TP-Link smart devices. Could you list out everything that's discoverable, maybe targeting my home subnet 192.168.1.0/24?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can you pull up all the current stats and details for my kitchen smart plug? I want to check its current status and specifications."
  },
  {
    "tool_name": "kasa_tool",
    "query": "I'm troubleshooting my living room lamp and need to verify its exact model and connection parameters. What information can you retrieve about this specific device?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "I'm heading out and want to make sure the kitchen smart plug is completely shut down - can you help me kill its power?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Emergency power conservation mode: switch my home office equipment off remotely right now"
  },
  {
    "tool_name": "kasa_tool",
    "query": "My living room feels a bit harsh right now - can you dim the kitchen pendant lights to around 40% so it's more relaxing?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "These smart bulbs are way too bright when I'm trying to wind down. Reduce the luminosity of the bedside lamp to approximately 25% brightness, please."
  },
  {
    "tool_name": "kasa_tool",
    "query": "I want my living room lamp to match the sunset - can you make it a deep orange-red with high intensity?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Change the kitchen light to a rich emerald green at about 75% brightness - it'll help set the mood for dinner"
  },
  {
    "tool_name": "kasa_tool",
    "query": "My living room feels too harsh right now - can we shift the bulbs to a warmer, more relaxing 2700K tone for evening reading?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "I want the kitchen lights to mimic natural daylight - adjust them to around 5000K so I can see everything clearly while cooking"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can you pull the electricity consumption data for my kitchen smart plug over the past month? I'm trying to understand its power draw."
  },
  {
    "tool_name": "kasa_tool",
    "query": "How much energy has my home office power strip been drawing today? I want to track its real-time consumption for my energy efficiency project."
  },
  {
    "tool_name": "kasa_tool",
    "query": "I want to rename my kitchen smart plug from 'Plug 1' to 'Counter Appliance Power' so it's more descriptive in my home automation setup"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can you help me update the label for my living room smart outlet? It's currently just showing a generic number, and I'd prefer something that tells me exactly what it controls"
  },
  {
    "tool_name": "kasa_tool",
    "query": "I want to see what devices are plugged into my multi-outlet smart power strip. Can you list out all the individual outlets and their current status?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "My TP-Link power strip has several things connected - show me the breakdown of each child device's details and power consumption right now"
  },
  {
    "tool_name": "kasa_tool",
    "query": "My workshop power strip has several tools plugged in. Can you switch off the outlet powering my soldering station right now?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "I'm worried about the kids' gaming setup leaving the second socket of the living room power strip running overnight. Would you turn that specific outlet off for me?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "I want to check how much electricity my smart plugs are consuming this month"
  },
  {
    "tool_name": "kasa_tool",
    "query": "Can someone help me turn off all my smart home devices remotely? I'm worried I left something on at home"
  },
  {
    "tool_name": "kasa_tool",
    "query": "I just moved into a new place and need to scan my network for all my Kasa smart devices to make sure they're connected"
  },
  {
    "tool_name": "kasa_tool",
    "query": "My living room light strip seems stuck - how can I reset or get more information about its current status?"
  },
  {
    "tool_name": "kasa_tool",
    "query": "I want to rename my smart outlets so they're easier to identify in my home automation setup"
  }
]